<?php
$string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня черешня груша яблоко черешня вишня';

$arr=explode(' ',$string);
$mas=array($arr[0]=>0);
foreach($arr as $val){
    $z=true;
    foreach($mas as $k=>$v){
        if($val==$k){
            $mas[$k]++;
            $z=false;
            break;
        }
    }
    if($z==true){$mas[$val]=1;}
}
arsort($mas);
foreach ($mas as $k=>$v){
    echo "$k - $v <br>";
}
